[
  {
    "line": 187,
    "text": "Your pipes act as Reaction Wheels. When you pump water through the circular pipe in one direction, the water gains \"Angular Momentum.\" Because the total momentum of the Earth-pipe system must stay at zero (unless acted on by an outside force), the Earth itself must rotate in the opposite direction.",
    "type": "definition"
  },
  {
    "line": 287,
    "text": "In physics, Impulse is defined as J=∫Fdt. To move the Earth, you need a Net Impulse greater than zero.",
    "type": "definition"
  },
  {
    "line": 289,
    "text": "To get back to your starting position to \"jerk\" again, you must eventually move system A back.",
    "type": "definition"
  },
  {
    "line": 351,
    "text": "To achieve this change, the water in your pipes must carry the exact amount of \"Angular Momentum\" that we want to take away from (or add to) the Earth.",
    "type": "definition"
  },
  {
    "line": 384,
    "text": "Because light pressure (radiation pressure) is incredibly weak, a solar sail must have a massive surface area to capture enough photons to move a mass as significant as Earth's.",
    "type": "definition"
  },
  {
    "line": 520,
    "text": "For a massive population, a simple \"room\" isn't enough. We need gravity to prevent bone loss. This requires building O’Neill Cylinders—giant rotating tubes miles long.",
    "type": "definition"
  },
  {
    "line": 577,
    "text": "The Trade-off: It requires a staggering amount of energy. You would likely need to dismantle a smaller planet (like Mercury) just to get the fusion fuel required to push the Moon out of the Sun's gravity.",
    "type": "definition"
  },
  {
    "line": 649,
    "text": "While moving the Moon is technically 81 times easier, it still requires Stellar-scale energy. To push the Moon out of the Solar System, you would need to convert a significant portion of the Moon's own mass into energy, or build a \"Dyson Swarm\" around the Sun to beam power to the lunar engines.",
    "type": "definition"
  },
  {
    "line": 678,
    "text": "The Moon-Lifeboat (Option A) is the \"Better\" Engineering Solution. If the goal is purely the survival of the human species and our technology, moving the Moon as a standalone ship is far more realistic. It requires less energy, happens faster, and involves fewer \"unknowns\" regarding planetary physics.",
    "type": "definition"
  },
  {
    "line": 679,
    "text": "The Earth-Tugboat (Option B) is the \"Better\" Moral Solution. If the goal is to save the planet and everything that ever lived on it, we must take the Earth. Moving the Moon alone is an admission of defeat—it means we have given up on 4 billion years of biological history.",
    "type": "definition"
  },
  {
    "line": 773,
    "text": "Before any movement happens, we must industrialize the Moon.",
    "type": "definition"
  },
  {
    "line": 824,
    "text": "In your migration scenario, this manifesto would dictate that the Moon must be a Svalbard Global Seed Vault on steroids.",
    "type": "definition"
  },
  {
    "line": 830,
    "text": "Your Plan: Moving a planet requires us to become a Type II Civilization. The \"manifesto\" here is that we cannot leave the Sun until we have first mastered it.",
    "type": "definition"
  },
  {
    "line": 837,
    "text": "Tidal Respect: Gravitational maneuvers between the Moon and Earth must be calculated to prevent the \"Tidal Apocalypse.\"",
    "type": "definition"
  },
  {
    "line": 895,
    "text": "Collective Investment: The resources required are so vast that no single billionaire or nation could afford them. It requires the combined GDP of the entire world, which naturally gives every participant a \"seat at the table.\"",
    "type": "definition"
  },
  {
    "line": 924,
    "text": "To be intellectually honest: it would be the hardest thing humanity has ever done. It requires a total pivot in how we view time, money, and our place in the universe.",
    "type": "definition"
  },
  {
    "line": 925,
    "text": "Currently, we are a \"Type 0\" civilization—we fight over borders and short-term quarterly profits. To move the Earth, we must become a \"Type II\" civilization. The \"hardness\" isn't just in the math; it's in the social and physical inertia.",
    "type": "definition"
  },
  {
    "line": 938,
    "text": "The Solution: You have to tie the project to immediate benefits. The \"jobs\" and \"wealth\" from mining the Moon (platinum, helium-3, rare earth metals) must provide a high standard of living now, while the \"Planetary Move\" happens in the background. It has to be an economy that thrives because it is moving the world.",
    "type": "definition"
  },
  {
    "line": 947,
    "text": "Getting started isn't about moving the planet yet; it's about establishing the foothold. | Step | Difficulty (1-10) | Status | | :--- | :--- | :--- | | Permanent Moon Base | 4 | We are doing this now (Artemis Program). | | Lunar Industry | 7 | Requires autonomous robots we don't have yet. | | Massive Orbital Construction | 8 | Needs a \"Space Elevator\" or 100× cheaper rockets. | | The \"Dyson\" Step | 10 | Requires us to dismantle a small moon/planet for parts. |",
    "type": "definition"
  },
  {
    "line": 972,
    "text": "To keep the human psyche healthy during the \"Wandering\" years, architecture must be psychological:",
    "type": "definition"
  },
  {
    "line": 1007,
    "text": "The Problem: In a move, we lose the \"Free Services\" of the Sun and the global weather system. Every molecule of oxygen, every drop of water, and every gram of nutrient must be recycled perfectly.",
    "type": "definition"
  },
  {
    "line": 1069,
    "text": "The project forces a Resource-Based Economy. When the goal is \"Move the World,\" wasting resources on war or luxury vanity becomes a crime against the species.",
    "type": "definition"
  },
  {
    "line": 1072,
    "text": "The Council of Engineers/Ecology: Decisions wouldn't be made by popularity, but by \"System Health.\" If the Moon’s thrust is off by 0.001%, that is a technical problem that requires a technical solution, not a political debate.",
    "type": "definition"
  },
  {
    "line": 1087,
    "text": "Their Focus: They don't look at it as a \"movie plot\"; they look at it as Existential Risk Mitigation. * The Conclusion: They argue that \"Planetary Earth\" is a single-point-of-failure for human consciousness. To ensure we last millions of years, we must eventually move the Earth or colonize other stars. They provide the \"Manifesto\" logic you were asking about.",
    "type": "definition"
  },
  {
    "line": 1155,
    "text": "Contrast: Caplan suggests moving the Sun to pull the entire Solar System. You suggest moving the Moon to pull the Earth. Your version is more \"resource-conscious\" for an earlier-stage civilization (Type I), as moving a star requires dismantling whole planets just for the engine's casing.",
    "type": "definition"
  },
  {
    "line": 1175,
    "text": "Alignment: They see the next 500–1,000 years as a \"hinge of history\" where we must transition from a planetary species to a multi-planetary or interstellar one. They treat your 500-year plan not as a choice, but as a moral imperative.",
    "type": "definition"
  },
  {
    "line": 1221,
    "text": "To survive the millions of miles of deep space between stars, we must switch from Solar Beaming to Onboard Fusion.",
    "type": "definition"
  },
  {
    "line": 1226,
    "text": "To prevent a 10,000-year dictatorship or hijacking, the energy system must be built into the Bedrock Architecture we discussed:",
    "type": "definition"
  },
  {
    "line": 1252,
    "text": "Since the goal is to save \"everyone,\" how would we decide who gets to live in the \"Prime\" underwater cities with the best views vs. the deep-crust industrial hives? Would you like to explore a \"Social Lottery\" or \"Merit-Based\" housing model for this 10,000-year journey?",
    "type": "definition"
  },
  {
    "line": 1255,
    "text": "Mathematically and physically, it is possible, but it requires us to stop treating Earth as a \"resource to be used\" and start treating it as a \"closed-loop machine\" with zero margin for error.",
    "type": "definition"
  },
  {
    "line": 1258,
    "text": "On a normal Earth, the Sun provides \"free\" energy for photosynthesis. In the dark, we must replace the Sun with Fusion-Powered LED Hives.",
    "type": "definition"
  },
  {
    "line": 1263,
    "text": "Population Management: To keep the population stable for 5,000 years, births must be perfectly balanced with deaths. This requires a level of social planning we've never seen—a \"Global Harmony Pact\" where every new life is a celebrated, planned addition to the crew.",
    "type": "definition"
  },
  {
    "line": 1267,
    "text": "Decentralized Life Support: We would move away from \"cities\" and toward \"Self-Sustaining Hives.\" Each underground or underwater city must be able to survive even if the rest of the planet goes dark.",
    "type": "definition"
  },
  {
    "line": 1272,
    "text": "The Conclusion: Saving \"everyone\" isn't just a moral choice; it's a technical requirement. To keep the \"Ship\" (Earth) from being sabotaged by its own crew, the quality of life must be high and equal for every person.",
    "type": "definition"
  },
  {
    "line": 1359,
    "text": "The Maneuver: Changing the course of a planet is incredibly \"expensive\" in terms of energy. To \"turn\" the Earth toward a new target requires firing the engines for decades. If we realize the target is bad too late, we might not have the fuel to change course again. This makes the Navigator the most important person in the \"Active Shift.\"",
    "type": "definition"
  },
  {
    "line": 1389,
    "text": "Eventually, the goal isn't just a \"Sun.\" It’s a Perfect Home. With your phased transition and cryo-sleep, we aren't looking for a \"good enough\" star because we are in no rush. We are looking for the Type-G or Type-K star with the perfect \"Habitable Zone\" where we can finally restart the rotation of the Earth, melt the oceans, and walk on the surface again.",
    "type": "definition"
  },
  {
    "line": 1431,
    "text": "By building the swarm during the journey, you solve the \"Arrival Energy Crisis.\" Most interstellar plans fail because the ship arrives \"empty\" and has to wait centuries to build infrastructure. Your plan ensures that the moment we see the new Sun, we are already harvesting it.",
    "type": "definition"
  },
  {
    "line": 1442,
    "text": "Magnetic Nozzles: We would use massive electromagnetic fields to \"shape\" the exhaust. This ensures that the heated air is moving at such extreme velocities that we get maximum \"thrust per molecule.\"",
    "type": "definition"
  },
  {
    "line": 1496,
    "text": "Uses the Sun's own mass as fuel. Highly efficient but requires Type II tech immediately.",
    "type": "definition"
  },
  {
    "line": 1531,
    "text": "Technical Scalability: 7/10 (Requires a Dyson Swarm, which is a massive leap).",
    "type": "definition"
  },
  {
    "line": 1533,
    "text": "Note on Tectonic Shifts: One risk your plan must monitor is the \"Tidal Heating\" caused by the Moon-tug. If the tug is too strong, the Earth’s core might get too hot, causing massive volcanic eruptions that could burn your \"Underground Hives.\"",
    "type": "definition"
  },
  {
    "line": 1599,
    "text": "To complete the Planetary Migration Manifesto, we must integrate the final piece: the Scout/Vanguard Redundancy.",
    "type": "definition"
  },
  {
    "line": 1658,
    "text": "It carries the genetic data and robotic \"nurseries\" to re-grow the crew once it arrives at the destination and the Dyson Swarm is built. The \"lifeboat\" may fail the living, but it must not fail the data.",
    "type": "definition"
  },
  {
    "line": 1712,
    "text": "The scouts pass the signal along like a relay race. This ensures that the Earth, the Vanguard Fleet, and the New Star are always in \"Low Latency\" communication.",
    "type": "definition"
  },
  {
    "line": 1818,
    "text": "The Exodus: Earth must be in the \"Deep Void\" by now.",
    "type": "definition"
  },
  {
    "line": 1831,
    "text": "To protect the \"Investment of Humanity,\" the defense system must evolve into a Planetary Immune System. It cannot be a single wall; it must be a multi-layered, self-healing network.",
    "type": "definition"
  },
  {
    "line": 1842,
    "text": "As the journey progresses, the threats change, so the defense must be Adaptive:",
    "type": "definition"
  },
  {
    "line": 1880,
    "text": "To protect the capital investment, we must establish The Shield before the Sword.",
    "type": "definition"
  },
  {
    "line": 1884,
    "text": "The Purpose: Most \"City-Killer\" asteroids are hard to see because they come from the direction of the Sun. This net creates a 100% transparent map of all Near-Earth Objects (NEOs).",
    "type": "definition"
  },
  {
    "line": 1885,
    "text": "The ROI: This ensures that the decades spent building the Moon-engines aren't interrupted by a \"surprise\" impact.",
    "type": "definition"
  }
]